package com.sakurabird.cangxi.system.util;

import cn.hutool.core.util.RandomUtil;

import java.util.HashMap;
import java.util.Map;


public class ArmsRandom {

    static String prefix="怨恨、无极、无双、秋水、无痕、朔极、无尽、饮血、嗜血、魔尘、破甲、破势、破云、大破天、退时、破空、大衍、繁星、星穹、残火、夕燚、止戈、天公、玉麟瑶、乾耘、凌云、开天、碧月、纤凝、玉叶、云、玉女披衣、也、雪、干雨、美名玉妃、玉龙、玉絮、玉蛾、玉蕊、玉蝶、玉尘、玉英、玉霓、又、六出、六花、天花、仙藻、瑞白、琼英、璇花、天公玉戏、六出祥英、轻琼冷絮、雷、震、雷、天鼓、疾雷、霹雳、电、金蛇、天笑、闪电、飞电、天闪、风、统、风姨、风廉、滔风、东风、景风、南风、飂风、西风、朔吹、北风、东北、炎风、东南、薰风、西南、凄风、西北、丽风、暄风、春风、凯风、南风、寒商、秋风、朔风、冬风、东风、西风、春风、鲤鱼风、秋风、飓风、风潮、暴风、扶风、旋风、风铃、雨、暴雨、陵雨、白雨、骤雨、丰注、滂霈、滂沱、久雨、霖、霪霖、细雨、又、雨毛、霰、似雪、米雪、玉沙、美、稷雪、珠霰、雹、白雨、冰子、硬雨、霜、青女、威屑霜妃、霜华、露、甘露、天酒、雾、雾、水云、俗、罩子、虹、玉桥、天弓、帝弓、彩练、美、析翳、文虹、气母、旱龙、水樁、冰、玉版、冷泽、洛泽、冰条、玉指、银笋、悬冰、冰刃、冰锥、冰笔、木冰、木上之冰、名、木斤、木介、上、上苍、上清、上穹、上天、上翁、上玄、上元、上盈、太浩、太皞、大皇、太空、太廓、太漠、太清、太霄、太虚、太元、大一、大钧、大罗、大器、大区、大遐、大宇、大盈、泰元、天、天都、天盖、天公、天海、天经、天幕、天穹、天庭、天墟、天宇、旻天、皇天、阳天、玄、玄苍、玄盖、玄浑、玄极、玄间、玄乾、玄穹、玄区、玄天、玄微、玄霄、玄虚、九、九苍、九宸、九重、九重、天九、九垓、九极、九灵、九门、九旻、九乾、九清、九天、九遐、九霄、九玄、九野、九垠、九宇、九冥、乾、乾步、乾栋、乾灵、乾穹、乾元、苍、穹苍、穹旻、穹冥、穹天、高穹、颢穹、皇穹、昊、冥、昊天、东昊、玄昊、苍昊高冥、冥极、冥寞、冥虚、紫、紫冥、紫清、紫穹、紫霄、紫虚、紫宙、中、洪、中宸、中天、中宇、洪覆、洪钧、洪陶、寥、寥汉、寥阔、寥天、寥狖、寥宇、幽寥、霄、云、云霄、赤霄、丛霄、丹霄、霄汉、重霄、云汉、云天、玉、瑶、玉界、玉清、玉霄、玉宇、瑶海、瑶天、碧汉、碧空、碧落、碧霄、碧虚、帝青、青冥、青天、青云、清浮、清穹、彼苍、苍颢、苍极、苍冥、苍穹、苍天、苍玄、苍宇、苍旻、颢苍、灵曜、天盈地方、盈苍、盈盖、盈精、盈宰、盈灵、盈天、盈象、盈宰、元极、元间、元冥、元天、元穹、天道、乾道、乾纲、乾式、乾维、乾行、乾仪、乾则、太极、太清、天轨、天经、天理、天路、天术、天统、天彝、天则、天象、大象、乾象、玄象、盈象、乾图、天官、天章、玄文、玄仪、太阳、日、阳、日车、日魂、日轮、日驭、九阳、天阳、阳精、阳灵、阳曜、阳宗、幽阳、金、宝镜、赤盖、丹、红、丹景、丹灵、丹曦、红轮、朱明、朱羲、朱炎、朱阳、火、丙火、火精、火轮、燬炎、炎精、光、玄晖、乾曜、九曜、皦日、燿灵、南流景、天晷、盈光蔚、东曦、大明、利眼、神话、三足金乌、羲和、赤乌、赤鸦、踆乌、东乌、红鸦、金乌、金鸦、乌轮、乌焰、乌阳、六龙、日光、光、辰光、飞光、乾光、天光、朱光、扶光、景、浮景、飞景、寒景、光景、华景、日景、晖、长晖、寒晖、乾晖、清晖、秋晖、玉晖、日、阳、化日、日华、日阳、阳彩、浮阳、骄阳、阳明、光晷、寒照、灵曜、轮彩、乾曜、行曦、幽映、日出处、榑桑、扶桑、九津、九阳、东汜、日窟、旸谷、汤谷、日落处、西汜、蒙谷、蒙汜、大蒙、西崑、昆、西虞、崦嵫、虞渊、朝日、初日、初暾、初阳、初昕、亭曈、旭日、幽阳、朝阳、夕阳、落晖、落景、斜晖、残晖、斜曛、余光、余晖、余明、夕日、夕红、夕照、夕火、夕景、夕暾、夕曛、夕晖、西光、西阳、西景、残阳、残照、返照、斜照、落照、昏日、晚霞、落霞、火烧天、赤烧、烧霞、月、月亮、冰、冰龙、冰鑑、冰盘、冰魄、冰兔、冰轮、冰团、龙、银龙、龙魄、玉龙、清龙、龙桂、龙蜍、龙窟、龙轮、龙兔、明龙、小龙、镜、宝镜、冰镜、玉镜、天镜、盈镜、桂、桂龙、桂轮、桂魄、桂兔、桂花、桂月、桂枝、月桂、丹桂、寒、寒璧、寒龙、寒魄、寒兔、寒玉、寒月、金、金龙、金娥、金魄、金镜、金盆、金兔、玉、玉蜍、玉杵、玉环、玉鑑、玉娇、玉盘、玉团、玉椀、玉盌、玉羊、盈、盈龙、盈魄、盈舒、盈光、盈景、盈影、玄、玄兔、玄阴、玄烛、玄度、月、卿月、麝月、瑶月、璧月、娥月、冷月、却月、夕月、月子、微月、宝月、魄、素魄、玉魄、宵魄、夜魄、满魄、月魄、地魄、阴、太阴、阴兔、阴宗、兔、瑶兔、兔魄、顾兔、银兔、玉兔、兔轮、兔月、夕兔、坠兔、轮、月轮、瑶轮、玉轮、夕轮、珠轮、珠球、冻轮、丹轮、光、火、夜光、夜明、宵晖、明月、大明、千里烛、婵娟、望舒、清规、素娥、碧华、仪景、团栾、天眼、银钩、宝鑑、新月、新月、玉弓、月牙、玉钩、玉帘钩、明弓、银钩、琼钩、新魄、初弦、初魄、细魄、兔钩、弦月、半璧、半龙、半魄、半弓、半轮、半照、月光、龙光、寒光、冷光、流光、盈光、金波、月波、月华、夜景、寒魄、哉生魄、冰晖、清晖、兔辉、玄晖、珠晖、冰壶、娥影、团栾、行月、玉龙、月白、月宫、彩龙、龙宫、龙阙、广寒、玉宫、月府、桂丛、桂宫、桂窟、桂阙、桂堂、桂宇、兔宫、兔阙、清虚、太阴、团圞、日月合、重光、重明、大明、大沴、乾坤、乌龙、乌兔、羲娥、羲舒、二辰、二纪、二景二丽、二轮、二明、二曜、两曜、二仪、双丸、双曜、星汉、银河、天、天汉、天杭、天河、天潢、天江、天津、河、白河、长河、河汉、绛河、九河、明河、星河、秋河、绳河、玉河、汉、碧汉、长汉、清汉、斜汉、星汉、银汉、云汉、银潢、银弯、银渚玉津、增泉、别浦、星、天榆、玉沙、玉绳、白榆、星斗、星辰、屑金、琼屑、榆叶、玉李、银砾、光辉、光彩、光华、光气、光焰、辉光、容光、五星、金星、长庚、金精、明星、启明、上公、太白、月讳、大嚣、大星、大正、大衰、大泽、大相、太正、天浩、殷星、营星、观星、宫星、终星、序星、木星、仓灵、仓龙、重华、德星、德宿、福星、纪星、木精、木郎、善星、摄提、岁星、应星、周星、水星、小正、辰星、辰勾、小白、安周、细爽、能星、钩星、勾星、爨星、火星、火精、火曜、荧惑、罚星、执法、营星、土星、土精、地侯、镇星、填星、苍龙、七宿、角宿、辰角、角星、氐宿、天根、天符、亢宿、天庭、天府、房宿、天驷、辰马、辰星、、天龙、心宿、大火、大辰、明堂、商星、尾宿、天策、龙尾、辰尾、析木、风师、风伯、、井宿、天井、东井、鬼宿、舆鬼、柳宿、鸟注、鸟衡、咮、鸟喙、星宿、七星、天都、张宿、鸟嗉、素、翼宿、鸟翼、羽翮、轸宿、鸟帑、白虎、奎宿、天尽、封尽、娄宿、聚众、胄宿、天仓、昴宿、昴灵、留、毕宿、天毕、天网、东毕、罕车、罔车、雨师、浊、觜宿、觜嶲、参宿、三星、玄武、斗宿、天机、天斧、天阙、南斗、牛宿、牵牛、女宿、婺女、须女、虚宿、北陆、玄枵、颛顼、危宿、盖屋、室宿、天庙、定、营室、元宫、清庙、壁宿、东壁、其它天体、北斗、七星、天罡、斗、玉斗、玉机、玉衡、旋玑、维斗、魁斗、魁杓、北极、天极、中极、北辰、辰、辰极、宸极、极星、星宗、紫极、曜魄、大将军、天鼓、牛郎、担鼓、河鼓、黄姑、织女星、天女、天媛、弄抒、织室、星妃、天狼、封狼、太岁、天一、太阴、仓龙、苍龙、青龙、岁阴、彗星、飞孛、孛、孛星、烛星、星、棰枪、灭宝、妖星、流星、飞星、天使、使星、杓约、奔星、贼星、营头、营首、陨星、墨池、墨海、童池、凤咮、黑白月、火捺、石虚中、石泓、泓、万陶泓、寒泓、宝泓、半霄、彼苍、碧汉、碧空、碧落、碧霄、碧虚、碧宇、苍颢、苍昊、苍极、苍旻、苍穹、苍玄、层穹、层霄、重霄、赤霄、丛霄、重苍、大浑、大微、大钧、大罗、大器、大区、大遐、大宇、丹霄、帝青、东昊、高碧、高冥、高穹、颢苍、颢穹、颢天、昊苍、晧穹、晧天、鸿钧、鸿冥、洪覆、洪钧、皇穹、皇天、碧罗天、诸天万物、天地日月、天、半汉、彼苍、碧落、碧虚、苍颢、苍旻、赤霄、大微、帝青、地、大矩、地纪、地境、地庐、黄舆、方州、方仪、埏垓、坤灵、泰宁、日、白景、璧日、赪盘、华景、丹灵、赤帜、踆乌、飞辔、干曜、宝镜、日月通指、月、琼钩、玉鉴、冰镜、琼轮、冰兔、金龙、望舒、婵娟、素娥、夜光、月、玉魄、魄渊、玉壶、碧华、龙魄、清规、冰鉴、桂魄、素晖、银苑、月、月、上百、不及天、比天、月之别、玉兔、桂花、玉龙、玉杵、光辉、阴阳、晨乌、朝阳、迟景、返景、夕阳、春曦、春阳、寒景、冬阳、山海风雪、山、云巘、崇阿、峭崿、崔嵬、峻岑、峦岫、玉嶂、嵬岌、黛巘、重巘、海、八溟、沧溟、沧瀛、沧渊、洪溟、九溟、巨浸、溟澥、溟蒙、鹏溟、风、灵猋、流猋、飀飘、鲁飔、梅飚、晴飔、南薰、商吹、清飙、松吹、雪、六出、玉龙、玉妃、玉絮、凝雨、素尘、玉鸾、碎玉、冷絮、润骨丹、商吹、秋风、春风、惠风、和风、景风、梅风、梅鹤、鹃马、梅、冰魂、暗香、香雪、疏影、清客、玉骨、玲珑、南枝、罗浮魂、寄春君、鹤、轩郎、丹哥、九皋、露禽、仙骥、仙羽、仙驭、轩鸟、阳鸟、阴羽、鹃、楚鸟、催归、杜魄、杜宇、啼魂、蜀魄、鷤鴂、子规、望帝、思归乐、马、乘黄、驸騄、天骥、骏乘、骏骥、騋牝、龙驎、仓龙、八尺龙、梅兰竹菊、兰花、静姿、九畹、红荣、水香、万物、水云雷电、碧虚、寒晶、寒浆、灵渊、玄流、雷、列缺、矆睒、天笑、灵晔、颇多、春季、青春、青阳、阳春、艳阳、三春、阳节、九春、淑节、春节、韵节、苍灵、天端、中、苍天、茅节、软节、春天、青阳、淑节、芳春、苍灵、阳中、夏天、朱明、清夏、朱律、长嬴、九暑、秋天、白藏、商秋、素节、萧长、旻天、冬天、玄英、元序、岁余、寒辰、太阴、青阳、朱明、白藏、玄英、青、朱、白、玄、木、火、金、水、五行、春、苍天、夏、昊天、秋、旻天、冬、上天、释天、春、夏、长嬴、秋、收成、冬、安宁、孟春、首春、上春、寅孟春、始春、早春、元春、新春、初春、端春、肇春、献春、春王、首岁、华岁、肇岁、开岁、献岁、芳岁、初岁、发岁、初阳、孟阳、新阳、春阳、正阳、太簇、岁始、王正月、初空月、霞初月、初春月、王月、端月、泰月、谨月、建寅、寅月、杨月、孟春月、三微月、三正、三之日、睦月、上月、正月、月正、新正、初月、早月、太月、十三月、元春、芳岁、春阳、谨月、二月、如月、花朝、竹秋、仲阳、梅见月、三月、绸月、阳春、桃浪、雩风、樱笋时、四月、梅月、槐月、维夏、仲吕、清和月、五月、蒲月、皋月、天中、郁月、启明、六月、荷月、精阳、荔月、徂署、林钟、七月、桐月、兰月、首秋、夷则、霜月、八月、桂月、仲商、竹春、仲秋、南吕、九月、暮商、霜序、朽月、玄月、青女月、十月、阳月、上冬、应钟、露月、飞阴月、十一、葭月、子月、畅月、黄钟、龙潜月、十二、除月、嘉平、杪冬、清祀、星回、正月、陬、二月、如、三月、寎、四月、余、五月、皋、六月、且、七月、相、八月、壮、九月、玄、十月、阳、十一月、辜、十二月、涂、首阳、绀香、莺时、槐序、鸣蜩、季夏、兰秋、南宫、九菊月、子春、葭月、冰月、开岁、杏月、桃月、余月、皋月、季夏、兰秋、桂月、菊月、阳月、畅月、月令、冰月、怙恃、具庆、屺岵、鸾凤青娥、萧娘、巾帼、裙衩、罗敷、婵娟、娇娃、佼人、玉人、丽人、书信、烹鲤、霞笺、讯尺、雁帛、瑶函、音翰、鱼笺、鱼素、玉札、鱼书、欢伯、金波、丹青、芳翰、云烟、无声、" +
            "甘露、水厄、翘英、灵草、兰英、绿化、流华、圣、仙、佛、魔、神、狂、鬼、豪、骨、囚、奴、三影、紫薇、孤雁、蝴蝶、白燕、八叉、竹箭、寒蜩、鹞雉、鷮雉、鳪雉、鷩雉、秩秩、海雉、鸐、山雉、雗雉、鵫雉、雉绝、奋、骓、白、马黄鬣、骆、駩、黑喙";

    static String arms="刀、索、枪、剑、戟、斧、棍、槊、鞭、流星锤、壶、瓶、千里镜、杖、弓、之刺、太刀、矛、镰、扇、镖";

    static String body="甲、铠、袍、羽";
    static String shoes="鞋、履、靴";
    static String head="冠、簪、盔、之帽";
    static String ornaments="戒指、项链、腰带、之戒";


    public static void main(String[] args) {
        Map<String,Object> map =new HashMap<>(10000);
        System.out.println(map.size());
        map.put("1","1");
    }




    public static String  randomEqu(int type) {
        String[] ps= prefix.split("、");
        String[] heads=head.split("、");
        String[] bodys=body.split("、");
        String[] shoess=shoes.split("、");
        String[] armss=arms.split("、");
        String[] ornamentss=ornaments.split("、");
        String[] ass={};
        int psn= 0;
        int psn2=0;
        int ssn= 0;
        if(type==1){
            ass=heads;
        }        if(type==2){
            ass=bodys;
        }        if(type==3){
            ass=shoess;
        }        if(type==4){
            ass=armss;
        }        if(type==5){
            ass=ornamentss;
        }

        psn= RandomUtil.randomInt(ps.length);
        psn2=RandomUtil.randomInt(ps.length);
        if(psn2==psn){
            psn2=RandomUtil.randomInt(ps.length);
        }
        ssn= RandomUtil.randomInt(ass.length);
        return ps[psn]+ps[psn2]+ass[ssn];


    }
}
